Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/ssc.h
/*
 * Component description for SSC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:35:01Z  */
#ifndef _PIC32CZCA70_SSC_COMPONENT_H_
#define _PIC32CZCA70_SSC_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR SSC                       */
/* ************************************************************************** */

/* -------- SSC_CR : (SSC Offset: 0x00) ( /W 32) Control Register -------- */
#define SSC_CR_RXEN_Pos                       _UINT32_(0)                                          /* (SSC_CR) Receive Enable Position */
#define SSC_CR_RXEN_Msk                       (_UINT32_(0x1) << SSC_CR_RXEN_Pos)                   /* (SSC_CR) Receive Enable Mask */
#define SSC_CR_RXEN(value)                    (SSC_CR_RXEN_Msk & (_UINT32_(value) << SSC_CR_RXEN_Pos)) /* Assignment of value for RXEN in the SSC_CR register */
#define SSC_CR_RXDIS_Pos                      _UINT32_(1)                                          /* (SSC_CR) Receive Disable Position */
#define SSC_CR_RXDIS_Msk                      (_UINT32_(0x1) << SSC_CR_RXDIS_Pos)                  /* (SSC_CR) Receive Disable Mask */
#define SSC_CR_RXDIS(value)                   (SSC_CR_RXDIS_Msk & (_UINT32_(value) << SSC_CR_RXDIS_Pos)) /* Assignment of value for RXDIS in the SSC_CR register */
#define SSC_CR_TXEN_Pos                       _UINT32_(8)                                          /* (SSC_CR) Transmit Enable Position */
#define SSC_CR_TXEN_Msk                       (_UINT32_(0x1) << SSC_CR_TXEN_Pos)                   /* (SSC_CR) Transmit Enable Mask */
#define SSC_CR_TXEN(value)                    (SSC_CR_TXEN_Msk & (_UINT32_(value) << SSC_CR_TXEN_Pos)) /* Assignment of value for TXEN in the SSC_CR register */
#define SSC_CR_TXDIS_Pos                      _UINT32_(9)                                          /* (SSC_CR) Transmit Disable Position */
#define SSC_CR_TXDIS_Msk                      (_UINT32_(0x1) << SSC_CR_TXDIS_Pos)                  /* (SSC_CR) Transmit Disable Mask */
#define SSC_CR_TXDIS(value)                   (SSC_CR_TXDIS_Msk & (_UINT32_(value) << SSC_CR_TXDIS_Pos)) /* Assignment of value for TXDIS in the SSC_CR register */
#define SSC_CR_SWRST_Pos                      _UINT32_(15)                                         /* (SSC_CR) Software Reset Position */
#define SSC_CR_SWRST_Msk                      (_UINT32_(0x1) << SSC_CR_SWRST_Pos)                  /* (SSC_CR) Software Reset Mask */
#define SSC_CR_SWRST(value)                   (SSC_CR_SWRST_Msk & (_UINT32_(value) << SSC_CR_SWRST_Pos)) /* Assignment of value for SWRST in the SSC_CR register */
#define SSC_CR_Msk                            _UINT32_(0x00008303)                                 /* (SSC_CR) Register Mask  */


/* -------- SSC_CMR : (SSC Offset: 0x04) (R/W 32) Clock Mode Register -------- */
#define SSC_CMR_DIV_Pos                       _UINT32_(0)                                          /* (SSC_CMR) Clock Divider Position */
#define SSC_CMR_DIV_Msk                       (_UINT32_(0xFFF) << SSC_CMR_DIV_Pos)                 /* (SSC_CMR) Clock Divider Mask */
#define SSC_CMR_DIV(value)                    (SSC_CMR_DIV_Msk & (_UINT32_(value) << SSC_CMR_DIV_Pos)) /* Assignment of value for DIV in the SSC_CMR register */
#define SSC_CMR_Msk                           _UINT32_(0x00000FFF)                                 /* (SSC_CMR) Register Mask  */


/* -------- SSC_RCMR : (SSC Offset: 0x10) (R/W 32) Receive Clock Mode Register -------- */
#define SSC_RCMR_CKS_Pos                      _UINT32_(0)                                          /* (SSC_RCMR) Receive Clock Selection Position */
#define SSC_RCMR_CKS_Msk                      (_UINT32_(0x3) << SSC_RCMR_CKS_Pos)                  /* (SSC_RCMR) Receive Clock Selection Mask */
#define SSC_RCMR_CKS(value)                   (SSC_RCMR_CKS_Msk & (_UINT32_(value) << SSC_RCMR_CKS_Pos)) /* Assignment of value for CKS in the SSC_RCMR register */
#define   SSC_RCMR_CKS_MCK_Val                _UINT32_(0x0)                                        /* (SSC_RCMR) Divided Clock  */
#define   SSC_RCMR_CKS_TK_Val                 _UINT32_(0x1)                                        /* (SSC_RCMR) TK Clock signal  */
#define   SSC_RCMR_CKS_RK_Val                 _UINT32_(0x2)                                        /* (SSC_RCMR) RK pin  */
#define SSC_RCMR_CKS_MCK                      (SSC_RCMR_CKS_MCK_Val << SSC_RCMR_CKS_Pos)           /* (SSC_RCMR) Divided Clock Position */
#define SSC_RCMR_CKS_TK                       (SSC_RCMR_CKS_TK_Val << SSC_RCMR_CKS_Pos)            /* (SSC_RCMR) TK Clock signal Position */
#define SSC_RCMR_CKS_RK                       (SSC_RCMR_CKS_RK_Val << SSC_RCMR_CKS_Pos)            /* (SSC_RCMR) RK pin Position */
#define SSC_RCMR_CKO_Pos                      _UINT32_(2)                                          /* (SSC_RCMR) Receive Clock Output Mode Selection Position */
#define SSC_RCMR_CKO_Msk                      (_UINT32_(0x7) << SSC_RCMR_CKO_Pos)                  /* (SSC_RCMR) Receive Clock Output Mode Selection Mask */
#define SSC_RCMR_CKO(value)                   (SSC_RCMR_CKO_Msk & (_UINT32_(value) << SSC_RCMR_CKO_Pos)) /* Assignment of value for CKO in the SSC_RCMR register */
#define   SSC_RCMR_CKO_NONE_Val               _UINT32_(0x0)                                        /* (SSC_RCMR) None, RK pin is an input  */
#define   SSC_RCMR_CKO_CONTINUOUS_Val         _UINT32_(0x1)                                        /* (SSC_RCMR) Continuous Receive Clock, RK pin is an output  */
#define   SSC_RCMR_CKO_TRANSFER_Val           _UINT32_(0x2)                                        /* (SSC_RCMR) Receive Clock only during data transfers, RK pin is an output  */
#define SSC_RCMR_CKO_NONE                     (SSC_RCMR_CKO_NONE_Val << SSC_RCMR_CKO_Pos)          /* (SSC_RCMR) None, RK pin is an input Position */
#define SSC_RCMR_CKO_CONTINUOUS               (SSC_RCMR_CKO_CONTINUOUS_Val << SSC_RCMR_CKO_Pos)    /* (SSC_RCMR) Continuous Receive Clock, RK pin is an output Position */
#define SSC_RCMR_CKO_TRANSFER                 (SSC_RCMR_CKO_TRANSFER_Val << SSC_RCMR_CKO_Pos)      /* (SSC_RCMR) Receive Clock only during data transfers, RK pin is an output Position */
#define SSC_RCMR_CKI_Pos                      _UINT32_(5)                                          /* (SSC_RCMR) Receive Clock Inversion Position */
#define SSC_RCMR_CKI_Msk                      (_UINT32_(0x1) << SSC_RCMR_CKI_Pos)                  /* (SSC_RCMR) Receive Clock Inversion Mask */
#define SSC_RCMR_CKI(value)                   (SSC_RCMR_CKI_Msk & (_UINT32_(value) << SSC_RCMR_CKI_Pos)) /* Assignment of value for CKI in the SSC_RCMR register */
#define SSC_RCMR_CKG_Pos                      _UINT32_(6)                                          /* (SSC_RCMR) Receive Clock Gating Selection Position */
#define SSC_RCMR_CKG_Msk                      (_UINT32_(0x3) << SSC_RCMR_CKG_Pos)                  /* (SSC_RCMR) Receive Clock Gating Selection Mask */
#define SSC_RCMR_CKG(value)                   (SSC_RCMR_CKG_Msk & (_UINT32_(value) << SSC_RCMR_CKG_Pos)) /* Assignment of value for CKG in the SSC_RCMR register */
#define   SSC_RCMR_CKG_CONTINUOUS_Val         _UINT32_(0x0)                                        /* (SSC_RCMR) None  */
#define   SSC_RCMR_CKG_EN_RF_LOW_Val          _UINT32_(0x1)                                        /* (SSC_RCMR) Receive Clock enabled only if RF Low  */
#define   SSC_RCMR_CKG_EN_RF_HIGH_Val         _UINT32_(0x2)                                        /* (SSC_RCMR) Receive Clock enabled only if RF High  */
#define SSC_RCMR_CKG_CONTINUOUS               (SSC_RCMR_CKG_CONTINUOUS_Val << SSC_RCMR_CKG_Pos)    /* (SSC_RCMR) None Position */
#define SSC_RCMR_CKG_EN_RF_LOW                (SSC_RCMR_CKG_EN_RF_LOW_Val << SSC_RCMR_CKG_Pos)     /* (SSC_RCMR) Receive Clock enabled only if RF Low Position */
#define SSC_RCMR_CKG_EN_RF_HIGH               (SSC_RCMR_CKG_EN_RF_HIGH_Val << SSC_RCMR_CKG_Pos)    /* (SSC_RCMR) Receive Clock enabled only if RF High Position */
#define SSC_RCMR_START_Pos                    _UINT32_(8)                                          /* (SSC_RCMR) Receive Start Selection Position */
#define SSC_RCMR_START_Msk                    (_UINT32_(0xF) << SSC_RCMR_START_Pos)                /* (SSC_RCMR) Receive Start Selection Mask */
#define SSC_RCMR_START(value)                 (SSC_RCMR_START_Msk & (_UINT32_(value) << SSC_RCMR_START_Pos)) /* Assignment of value for START in the SSC_RCMR register */
#define   SSC_RCMR_START_CONTINUOUS_Val       _UINT32_(0x0)                                        /* (SSC_RCMR) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.  */
#define   SSC_RCMR_START_TRANSMIT_Val         _UINT32_(0x1)                                        /* (SSC_RCMR) Transmit start  */
#define   SSC_RCMR_START_RF_LOW_Val           _UINT32_(0x2)                                        /* (SSC_RCMR) Detection of a low level on RF signal  */
#define   SSC_RCMR_START_RF_HIGH_Val          _UINT32_(0x3)                                        /* (SSC_RCMR) Detection of a high level on RF signal  */
#define   SSC_RCMR_START_RF_FALLING_Val       _UINT32_(0x4)                                        /* (SSC_RCMR) Detection of a falling edge on RF signal  */
#define   SSC_RCMR_START_RF_RISING_Val        _UINT32_(0x5)                                        /* (SSC_RCMR) Detection of a rising edge on RF signal  */
#define   SSC_RCMR_START_RF_LEVEL_Val         _UINT32_(0x6)                                        /* (SSC_RCMR) Detection of any level change on RF signal  */
#define   SSC_RCMR_START_RF_EDGE_Val          _UINT32_(0x7)                                        /* (SSC_RCMR) Detection of any edge on RF signal  */
#define   SSC_RCMR_START_CMP_0_Val            _UINT32_(0x8)                                        /* (SSC_RCMR) Compare 0  */
#define SSC_RCMR_START_CONTINUOUS             (SSC_RCMR_START_CONTINUOUS_Val << SSC_RCMR_START_Pos) /* (SSC_RCMR) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data. Position */
#define SSC_RCMR_START_TRANSMIT               (SSC_RCMR_START_TRANSMIT_Val << SSC_RCMR_START_Pos)  /* (SSC_RCMR) Transmit start Position */
#define SSC_RCMR_START_RF_LOW                 (SSC_RCMR_START_RF_LOW_Val << SSC_RCMR_START_Pos)    /* (SSC_RCMR) Detection of a low level on RF signal Position */
#define SSC_RCMR_START_RF_HIGH                (SSC_RCMR_START_RF_HIGH_Val << SSC_RCMR_START_Pos)   /* (SSC_RCMR) Detection of a high level on RF signal Position */
#define SSC_RCMR_START_RF_FALLING             (SSC_RCMR_START_RF_FALLING_Val << SSC_RCMR_START_Pos) /* (SSC_RCMR) Detection of a falling edge on RF signal Position */
#define SSC_RCMR_START_RF_RISING              (SSC_RCMR_START_RF_RISING_Val << SSC_RCMR_START_Pos) /* (SSC_RCMR) Detection of a rising edge on RF signal Position */
#define SSC_RCMR_START_RF_LEVEL               (SSC_RCMR_START_RF_LEVEL_Val << SSC_RCMR_START_Pos)  /* (SSC_RCMR) Detection of any level change on RF signal Position */
#define SSC_RCMR_START_RF_EDGE                (SSC_RCMR_START_RF_EDGE_Val << SSC_RCMR_START_Pos)   /* (SSC_RCMR) Detection of any edge on RF signal Position */
#define SSC_RCMR_START_CMP_0                  (SSC_RCMR_START_CMP_0_Val << SSC_RCMR_START_Pos)     /* (SSC_RCMR) Compare 0 Position */
#define SSC_RCMR_STOP_Pos                     _UINT32_(12)                                         /* (SSC_RCMR) Receive Stop Selection Position */
#define SSC_RCMR_STOP_Msk                     (_UINT32_(0x1) << SSC_RCMR_STOP_Pos)                 /* (SSC_RCMR) Receive Stop Selection Mask */
#define SSC_RCMR_STOP(value)                  (SSC_RCMR_STOP_Msk & (_UINT32_(value) << SSC_RCMR_STOP_Pos)) /* Assignment of value for STOP in the SSC_RCMR register */
#define SSC_RCMR_STTDLY_Pos                   _UINT32_(16)                                         /* (SSC_RCMR) Receive Start Delay Position */
#define SSC_RCMR_STTDLY_Msk                   (_UINT32_(0xFF) << SSC_RCMR_STTDLY_Pos)              /* (SSC_RCMR) Receive Start Delay Mask */
#define SSC_RCMR_STTDLY(value)                (SSC_RCMR_STTDLY_Msk & (_UINT32_(value) << SSC_RCMR_STTDLY_Pos)) /* Assignment of value for STTDLY in the SSC_RCMR register */
#define SSC_RCMR_PERIOD_Pos                   _UINT32_(24)                                         /* (SSC_RCMR) Receive Period Divider Selection Position */
#define SSC_RCMR_PERIOD_Msk                   (_UINT32_(0xFF) << SSC_RCMR_PERIOD_Pos)              /* (SSC_RCMR) Receive Period Divider Selection Mask */
#define SSC_RCMR_PERIOD(value)                (SSC_RCMR_PERIOD_Msk & (_UINT32_(value) << SSC_RCMR_PERIOD_Pos)) /* Assignment of value for PERIOD in the SSC_RCMR register */
#define SSC_RCMR_Msk                          _UINT32_(0xFFFF1FFF)                                 /* (SSC_RCMR) Register Mask  */


/* -------- SSC_RFMR : (SSC Offset: 0x14) (R/W 32) Receive Frame Mode Register -------- */
#define SSC_RFMR_DATLEN_Pos                   _UINT32_(0)                                          /* (SSC_RFMR) Data Length Position */
#define SSC_RFMR_DATLEN_Msk                   (_UINT32_(0x1F) << SSC_RFMR_DATLEN_Pos)              /* (SSC_RFMR) Data Length Mask */
#define SSC_RFMR_DATLEN(value)                (SSC_RFMR_DATLEN_Msk & (_UINT32_(value) << SSC_RFMR_DATLEN_Pos)) /* Assignment of value for DATLEN in the SSC_RFMR register */
#define SSC_RFMR_LOOP_Pos                     _UINT32_(5)                                          /* (SSC_RFMR) Loop Mode Position */
#define SSC_RFMR_LOOP_Msk                     (_UINT32_(0x1) << SSC_RFMR_LOOP_Pos)                 /* (SSC_RFMR) Loop Mode Mask */
#define SSC_RFMR_LOOP(value)                  (SSC_RFMR_LOOP_Msk & (_UINT32_(value) << SSC_RFMR_LOOP_Pos)) /* Assignment of value for LOOP in the SSC_RFMR register */
#define SSC_RFMR_MSBF_Pos                     _UINT32_(7)                                          /* (SSC_RFMR) Most Significant Bit First Position */
#define SSC_RFMR_MSBF_Msk                     (_UINT32_(0x1) << SSC_RFMR_MSBF_Pos)                 /* (SSC_RFMR) Most Significant Bit First Mask */
#define SSC_RFMR_MSBF(value)                  (SSC_RFMR_MSBF_Msk & (_UINT32_(value) << SSC_RFMR_MSBF_Pos)) /* Assignment of value for MSBF in the SSC_RFMR register */
#define SSC_RFMR_DATNB_Pos                    _UINT32_(8)                                          /* (SSC_RFMR) Data Number per Frame Position */
#define SSC_RFMR_DATNB_Msk                    (_UINT32_(0xF) << SSC_RFMR_DATNB_Pos)                /* (SSC_RFMR) Data Number per Frame Mask */
#define SSC_RFMR_DATNB(value)                 (SSC_RFMR_DATNB_Msk & (_UINT32_(value) << SSC_RFMR_DATNB_Pos)) /* Assignment of value for DATNB in the SSC_RFMR register */
#define SSC_RFMR_FSLEN_Pos                    _UINT32_(16)                                         /* (SSC_RFMR) Receive Frame Sync Length Position */
#define SSC_RFMR_FSLEN_Msk                    (_UINT32_(0xF) << SSC_RFMR_FSLEN_Pos)                /* (SSC_RFMR) Receive Frame Sync Length Mask */
#define SSC_RFMR_FSLEN(value)                 (SSC_RFMR_FSLEN_Msk & (_UINT32_(value) << SSC_RFMR_FSLEN_Pos)) /* Assignment of value for FSLEN in the SSC_RFMR register */
#define SSC_RFMR_FSOS_Pos                     _UINT32_(20)                                         /* (SSC_RFMR) Receive Frame Sync Output Selection Position */
#define SSC_RFMR_FSOS_Msk                     (_UINT32_(0x7) << SSC_RFMR_FSOS_Pos)                 /* (SSC_RFMR) Receive Frame Sync Output Selection Mask */
#define SSC_RFMR_FSOS(value)                  (SSC_RFMR_FSOS_Msk & (_UINT32_(value) << SSC_RFMR_FSOS_Pos)) /* Assignment of value for FSOS in the SSC_RFMR register */
#define   SSC_RFMR_FSOS_NONE_Val              _UINT32_(0x0)                                        /* (SSC_RFMR) None, RF pin is an input  */
#define   SSC_RFMR_FSOS_NEGATIVE_Val          _UINT32_(0x1)                                        /* (SSC_RFMR) Negative Pulse, RF pin is an output  */
#define   SSC_RFMR_FSOS_POSITIVE_Val          _UINT32_(0x2)                                        /* (SSC_RFMR) Positive Pulse, RF pin is an output  */
#define   SSC_RFMR_FSOS_LOW_Val               _UINT32_(0x3)                                        /* (SSC_RFMR) Driven Low during data transfer, RF pin is an output  */
#define   SSC_RFMR_FSOS_HIGH_Val              _UINT32_(0x4)                                        /* (SSC_RFMR) Driven High during data transfer, RF pin is an output  */
#define   SSC_RFMR_FSOS_TOGGLING_Val          _UINT32_(0x5)                                        /* (SSC_RFMR) Toggling at each start of data transfer, RF pin is an output  */
#define SSC_RFMR_FSOS_NONE                    (SSC_RFMR_FSOS_NONE_Val << SSC_RFMR_FSOS_Pos)        /* (SSC_RFMR) None, RF pin is an input Position */
#define SSC_RFMR_FSOS_NEGATIVE                (SSC_RFMR_FSOS_NEGATIVE_Val << SSC_RFMR_FSOS_Pos)    /* (SSC_RFMR) Negative Pulse, RF pin is an output Position */
#define SSC_RFMR_FSOS_POSITIVE                (SSC_RFMR_FSOS_POSITIVE_Val << SSC_RFMR_FSOS_Pos)    /* (SSC_RFMR) Positive Pulse, RF pin is an output Position */
#define SSC_RFMR_FSOS_LOW                     (SSC_RFMR_FSOS_LOW_Val << SSC_RFMR_FSOS_Pos)         /* (SSC_RFMR) Driven Low during data transfer, RF pin is an output Position */
#define SSC_RFMR_FSOS_HIGH                    (SSC_RFMR_FSOS_HIGH_Val << SSC_RFMR_FSOS_Pos)        /* (SSC_RFMR) Driven High during data transfer, RF pin is an output Position */
#define SSC_RFMR_FSOS_TOGGLING                (SSC_RFMR_FSOS_TOGGLING_Val << SSC_RFMR_FSOS_Pos)    /* (SSC_RFMR) Toggling at each start of data transfer, RF pin is an output Position */
#define SSC_RFMR_FSEDGE_Pos                   _UINT32_(24)                                         /* (SSC_RFMR) Frame Sync Edge Detection Position */
#define SSC_RFMR_FSEDGE_Msk                   (_UINT32_(0x1) << SSC_RFMR_FSEDGE_Pos)               /* (SSC_RFMR) Frame Sync Edge Detection Mask */
#define SSC_RFMR_FSEDGE(value)                (SSC_RFMR_FSEDGE_Msk & (_UINT32_(value) << SSC_RFMR_FSEDGE_Pos)) /* Assignment of value for FSEDGE in the SSC_RFMR register */
#define   SSC_RFMR_FSEDGE_POSITIVE_Val        _UINT32_(0x0)                                        /* (SSC_RFMR) Positive Edge Detection  */
#define   SSC_RFMR_FSEDGE_NEGATIVE_Val        _UINT32_(0x1)                                        /* (SSC_RFMR) Negative Edge Detection  */
#define SSC_RFMR_FSEDGE_POSITIVE              (SSC_RFMR_FSEDGE_POSITIVE_Val << SSC_RFMR_FSEDGE_Pos) /* (SSC_RFMR) Positive Edge Detection Position */
#define SSC_RFMR_FSEDGE_NEGATIVE              (SSC_RFMR_FSEDGE_NEGATIVE_Val << SSC_RFMR_FSEDGE_Pos) /* (SSC_RFMR) Negative Edge Detection Position */
#define SSC_RFMR_FSLEN_EXT_Pos                _UINT32_(28)                                         /* (SSC_RFMR) FSLEN Field Extension Position */
#define SSC_RFMR_FSLEN_EXT_Msk                (_UINT32_(0xF) << SSC_RFMR_FSLEN_EXT_Pos)            /* (SSC_RFMR) FSLEN Field Extension Mask */
#define SSC_RFMR_FSLEN_EXT(value)             (SSC_RFMR_FSLEN_EXT_Msk & (_UINT32_(value) << SSC_RFMR_FSLEN_EXT_Pos)) /* Assignment of value for FSLEN_EXT in the SSC_RFMR register */
#define SSC_RFMR_Msk                          _UINT32_(0xF17F0FBF)                                 /* (SSC_RFMR) Register Mask  */


