Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/ssc.h
/* -------- SSC_TFMR : (SSC Offset: 0x1C) (R/W 32) Transmit Frame Mode Register -------- */
#define SSC_TFMR_DATLEN_Pos                   _UINT32_(0)                                          /* (SSC_TFMR) Data Length Position */
#define SSC_TFMR_DATLEN_Msk                   (_UINT32_(0x1F) << SSC_TFMR_DATLEN_Pos)              /* (SSC_TFMR) Data Length Mask */
#define SSC_TFMR_DATLEN(value)                (SSC_TFMR_DATLEN_Msk & (_UINT32_(value) << SSC_TFMR_DATLEN_Pos)) /* Assignment of value for DATLEN in the SSC_TFMR register */
#define SSC_TFMR_DATDEF_Pos                   _UINT32_(5)                                          /* (SSC_TFMR) Data Default Value Position */
#define SSC_TFMR_DATDEF_Msk                   (_UINT32_(0x1) << SSC_TFMR_DATDEF_Pos)               /* (SSC_TFMR) Data Default Value Mask */
#define SSC_TFMR_DATDEF(value)                (SSC_TFMR_DATDEF_Msk & (_UINT32_(value) << SSC_TFMR_DATDEF_Pos)) /* Assignment of value for DATDEF in the SSC_TFMR register */
#define SSC_TFMR_MSBF_Pos                     _UINT32_(7)                                          /* (SSC_TFMR) Most Significant Bit First Position */
#define SSC_TFMR_MSBF_Msk                     (_UINT32_(0x1) << SSC_TFMR_MSBF_Pos)                 /* (SSC_TFMR) Most Significant Bit First Mask */
#define SSC_TFMR_MSBF(value)                  (SSC_TFMR_MSBF_Msk & (_UINT32_(value) << SSC_TFMR_MSBF_Pos)) /* Assignment of value for MSBF in the SSC_TFMR register */
#define SSC_TFMR_DATNB_Pos                    _UINT32_(8)                                          /* (SSC_TFMR) Data Number per Frame Position */
#define SSC_TFMR_DATNB_Msk                    (_UINT32_(0xF) << SSC_TFMR_DATNB_Pos)                /* (SSC_TFMR) Data Number per Frame Mask */
#define SSC_TFMR_DATNB(value)                 (SSC_TFMR_DATNB_Msk & (_UINT32_(value) << SSC_TFMR_DATNB_Pos)) /* Assignment of value for DATNB in the SSC_TFMR register */
#define SSC_TFMR_FSLEN_Pos                    _UINT32_(16)                                         /* (SSC_TFMR) Transmit Frame Sync Length Position */
#define SSC_TFMR_FSLEN_Msk                    (_UINT32_(0xF) << SSC_TFMR_FSLEN_Pos)                /* (SSC_TFMR) Transmit Frame Sync Length Mask */
#define SSC_TFMR_FSLEN(value)                 (SSC_TFMR_FSLEN_Msk & (_UINT32_(value) << SSC_TFMR_FSLEN_Pos)) /* Assignment of value for FSLEN in the SSC_TFMR register */
#define SSC_TFMR_FSOS_Pos                     _UINT32_(20)                                         /* (SSC_TFMR) Transmit Frame Sync Output Selection Position */
#define SSC_TFMR_FSOS_Msk                     (_UINT32_(0x7) << SSC_TFMR_FSOS_Pos)                 /* (SSC_TFMR) Transmit Frame Sync Output Selection Mask */
#define SSC_TFMR_FSOS(value)                  (SSC_TFMR_FSOS_Msk & (_UINT32_(value) << SSC_TFMR_FSOS_Pos)) /* Assignment of value for FSOS in the SSC_TFMR register */
#define   SSC_TFMR_FSOS_NONE_Val              _UINT32_(0x0)                                        /* (SSC_TFMR) None, TF pin is an input  */
#define   SSC_TFMR_FSOS_NEGATIVE_Val          _UINT32_(0x1)                                        /* (SSC_TFMR) Negative Pulse, TF pin is an output  */
#define   SSC_TFMR_FSOS_POSITIVE_Val          _UINT32_(0x2)                                        /* (SSC_TFMR) Positive Pulse, TF pin is an output  */
#define   SSC_TFMR_FSOS_LOW_Val               _UINT32_(0x3)                                        /* (SSC_TFMR) Driven Low during data transfer  */
#define   SSC_TFMR_FSOS_HIGH_Val              _UINT32_(0x4)                                        /* (SSC_TFMR) Driven High during data transfer  */
#define   SSC_TFMR_FSOS_TOGGLING_Val          _UINT32_(0x5)                                        /* (SSC_TFMR) Toggling at each start of data transfer  */
#define SSC_TFMR_FSOS_NONE                    (SSC_TFMR_FSOS_NONE_Val << SSC_TFMR_FSOS_Pos)        /* (SSC_TFMR) None, TF pin is an input Position */
#define SSC_TFMR_FSOS_NEGATIVE                (SSC_TFMR_FSOS_NEGATIVE_Val << SSC_TFMR_FSOS_Pos)    /* (SSC_TFMR) Negative Pulse, TF pin is an output Position */
#define SSC_TFMR_FSOS_POSITIVE                (SSC_TFMR_FSOS_POSITIVE_Val << SSC_TFMR_FSOS_Pos)    /* (SSC_TFMR) Positive Pulse, TF pin is an output Position */
#define SSC_TFMR_FSOS_LOW                     (SSC_TFMR_FSOS_LOW_Val << SSC_TFMR_FSOS_Pos)         /* (SSC_TFMR) Driven Low during data transfer Position */
#define SSC_TFMR_FSOS_HIGH                    (SSC_TFMR_FSOS_HIGH_Val << SSC_TFMR_FSOS_Pos)        /* (SSC_TFMR) Driven High during data transfer Position */
#define SSC_TFMR_FSOS_TOGGLING                (SSC_TFMR_FSOS_TOGGLING_Val << SSC_TFMR_FSOS_Pos)    /* (SSC_TFMR) Toggling at each start of data transfer Position */
#define SSC_TFMR_FSDEN_Pos                    _UINT32_(23)                                         /* (SSC_TFMR) Frame Sync Data Enable Position */
#define SSC_TFMR_FSDEN_Msk                    (_UINT32_(0x1) << SSC_TFMR_FSDEN_Pos)                /* (SSC_TFMR) Frame Sync Data Enable Mask */
#define SSC_TFMR_FSDEN(value)                 (SSC_TFMR_FSDEN_Msk & (_UINT32_(value) << SSC_TFMR_FSDEN_Pos)) /* Assignment of value for FSDEN in the SSC_TFMR register */
#define SSC_TFMR_FSEDGE_Pos                   _UINT32_(24)                                         /* (SSC_TFMR) Frame Sync Edge Detection Position */
#define SSC_TFMR_FSEDGE_Msk                   (_UINT32_(0x1) << SSC_TFMR_FSEDGE_Pos)               /* (SSC_TFMR) Frame Sync Edge Detection Mask */
#define SSC_TFMR_FSEDGE(value)                (SSC_TFMR_FSEDGE_Msk & (_UINT32_(value) << SSC_TFMR_FSEDGE_Pos)) /* Assignment of value for FSEDGE in the SSC_TFMR register */
#define   SSC_TFMR_FSEDGE_POSITIVE_Val        _UINT32_(0x0)                                        /* (SSC_TFMR) Positive Edge Detection  */
#define   SSC_TFMR_FSEDGE_NEGATIVE_Val        _UINT32_(0x1)                                        /* (SSC_TFMR) Negative Edge Detection  */
#define SSC_TFMR_FSEDGE_POSITIVE              (SSC_TFMR_FSEDGE_POSITIVE_Val << SSC_TFMR_FSEDGE_Pos) /* (SSC_TFMR) Positive Edge Detection Position */
#define SSC_TFMR_FSEDGE_NEGATIVE              (SSC_TFMR_FSEDGE_NEGATIVE_Val << SSC_TFMR_FSEDGE_Pos) /* (SSC_TFMR) Negative Edge Detection Position */
#define SSC_TFMR_FSLEN_EXT_Pos                _UINT32_(28)                                         /* (SSC_TFMR) FSLEN Field Extension Position */
#define SSC_TFMR_FSLEN_EXT_Msk                (_UINT32_(0xF) << SSC_TFMR_FSLEN_EXT_Pos)            /* (SSC_TFMR) FSLEN Field Extension Mask */
#define SSC_TFMR_FSLEN_EXT(value)             (SSC_TFMR_FSLEN_EXT_Msk & (_UINT32_(value) << SSC_TFMR_FSLEN_EXT_Pos)) /* Assignment of value for FSLEN_EXT in the SSC_TFMR register */
#define SSC_TFMR_Msk                          _UINT32_(0xF1FF0FBF)                                 /* (SSC_TFMR) Register Mask  */


/* -------- SSC_RHR : (SSC Offset: 0x20) ( R/ 32) Receive Holding Register -------- */
#define SSC_RHR_RDAT_Pos                      _UINT32_(0)                                          /* (SSC_RHR) Receive Data Position */
#define SSC_RHR_RDAT_Msk                      (_UINT32_(0xFFFFFFFF) << SSC_RHR_RDAT_Pos)           /* (SSC_RHR) Receive Data Mask */
#define SSC_RHR_RDAT(value)                   (SSC_RHR_RDAT_Msk & (_UINT32_(value) << SSC_RHR_RDAT_Pos)) /* Assignment of value for RDAT in the SSC_RHR register */
#define SSC_RHR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SSC_RHR) Register Mask  */


/* -------- SSC_THR : (SSC Offset: 0x24) ( /W 32) Transmit Holding Register -------- */
#define SSC_THR_TDAT_Pos                      _UINT32_(0)                                          /* (SSC_THR) Transmit Data Position */
#define SSC_THR_TDAT_Msk                      (_UINT32_(0xFFFFFFFF) << SSC_THR_TDAT_Pos)           /* (SSC_THR) Transmit Data Mask */
#define SSC_THR_TDAT(value)                   (SSC_THR_TDAT_Msk & (_UINT32_(value) << SSC_THR_TDAT_Pos)) /* Assignment of value for TDAT in the SSC_THR register */
#define SSC_THR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (SSC_THR) Register Mask  */


